# Similar letter substituter
# To make text look a bit strange

from random import choice
from time import sleep

SLD = { 'A':'ĀĂĄАѦѨӐӒӔḀẲⰡ⍲ᗗ','a':'āăąаѧѩӑӓӕḁẳ⎀',
        'B':'ВѢҌ฿ḂḄḆᙗᙫ','b':'ЉЊБЪЬъыьѣҍḃḅḇᒀᖲ',
        'C':'ĆĊČСҪℂ℃','c':'ćĉċčсҫ',
        'D':'ĎĐḊḌḎḐḒ⫐⫒ᗫᗤ','d':'ďđԀԁԂԃḓḑḏḍḋᑽᖱ',
        'E':'ĒĔĖĘĚŒЀЁЄЕѤӔӖԘ⋵⋶ᕮ','e':'ēĕėęěœеѐёѥӕӗԙ',
        'F':'ҒӺḞ℉ᖴ','f':'ſғӻẛẜẝḟ',
        'G':'ĜĞĠĢԌḠ','g':'ĝğġģḡ',
        'H':'ĤĦЊНҔҢҤӇӉԊԢԨԪ','h':'ĥħЂЋђћҕңҥӈӊԡԦԧℎℏ',
        'I':'ĨĪĬİĲІЇЮѤѨӀ','i':'ĩīĭįıĳіїѩ༐༑',
        'J':'ĲĴЈЉӇԈԒԔᒏ','j':'ĳĵЛјӈԓԕ',
        'K':'ĶЌЖКҖҚҜҞҠӃԖԞԪ','k':'ķĸкҗқҝҟҡӄԗԟ',
        'L':'ĹĻĽĿŁḶḸḺḼᒺ','l':'ĺļľŀłӏḷḹḻḽ',
        'M':'МӍᴍḾṀṂ','m':'ӎᵚᵯmṃṁḿ',
        'N':'ŃŅŇŊЍИЙҊӢӤ','n':'ńņňŉŋҋᵰ',
        'O':'ŌŎŐŒОЮѺӦ⥀⥁','o':'ōŏőœбоѻӧ',
        'P':'РҎԖⰒⰐᑬᑭᑮᑶᑸ','p':'рҏԗᵱⱀᖰ',
        'Q':'ҀԚⰢ','q':'ҁԛⱉᖳ',
        'R':'ŔŖŘЯԄԆԖԘ℞ᖇ','r':'ŕŗřѓг',
        'S':'ŚŜŞŠЅṦṨᔡ','s':'śŝşšѕᵴṩṧṥ',
        'T':'ŢŤŦЂЃЋГТѢѢҬԎ','t':'ţťŧҭԏ',
        'U':'ŨŪŬŮŰŲ⩂⩁⋃ᙈᙀ','u':'ũūŭůűų',
        'V':'ѴѶṼṾⰜ⩢⩣⩛⩝⍱⋁ᐻ','v':'ѵѷṿṽⱌ⩡',
        'W':'ŴѠѼѾԜ','w':'ŵѡѽѿԝ⍹',
        'X':'ЖХҖӁӜӼӾԔ','x':'жхҗӂӝӽӿԕẋ',
        'Y':'ŶŸЎУҮӮӰӲ','y':'ŷуўӯӱӳ',
        'Z':'ŹŻŽᤏᤁ','z':'źżžᙇ',
        '.':'.․⁝⁞',
        '?':'?‽⁇⁈',
        '!':'!‽⁉',
       }

SLDVals = [i for i in SLD.keys()]

def oddify(text):
    result = ""
    for i in text:
        try: result += choice(SLD[i])
        except: result += i
    return result

def strgen(howlong=45):
    s = ''
    for i in range(howlong):
        s += choice(SLDVals)
    return s

while True:
    print(oddify(strgen()))
    sleep(.07)

