# Similar letter substituter
# To make text look a bit strange
# Now with added diacritics

from random import choice

SLD = { 'A':'ĀĂĄАѦѨӐӒӔḀẲⰡ⍲ᗗḀḂḄḆΆΑАѦѨӐӒ',
        'a':'āăąаѧѩӑӓӕḁẳ⎀ᴀӓӕḁảȃȧȁ',
        'B':'ВѢҌ฿ḂḄḆᙗᙫΒϐᗷᙖᗸʙßѢҌḂḄḆ',
        'b':'ЉЊБЪЬъыьѣҍḃḅḇᒀᖲʙᏏɓβþ',
        'C':'ĆĊČСҪℂ℃ϾϹÇĈҪɕĈƇ',
        'c':'ćĉċčҫçĉʗčƈ',
        'D':'ĎĐḊḌḎḐḒ⫐⫒ᗫᗤᎠᎴḎḊḐḒ',
        'd':'ďđԀԁԂԃḓḑḏḍḋᑽᖱɗð',
        'E':'ĒĔĖĘĚŒЀЁЄЕѤӔӖԘ⋵⋶ᕮЄЕЁѤ',
        'e':'ēĕėęěœеѐёѥӕӗԙȇȩȅ',
        'F':'ҒӺḞ℉ᖴҒӺḞϜϝƑғƒ',
        'f':'ſғӻẛẜẝḟƒʃғ',
        'G':'ĜĞĠĢԌḠǦǤǴǪᏀᏳԌ',
        'g':'ĝğġģḡǧǥǵɠ',
        'H':'ĤĦЊНҔҢҤӇӉԊԢԨԪĦΉҔҢҤ',
        'h':'ĥħЂЋђћҕңҥӈӊԡԦԧℎℏɦħʜ',
        'I':'ĨĪĬİĲІЇЮѤѨӀΊİЇ',
        'i':'ĩīĭįıĳіїѩ༐༑ȉȋ',
        'J':'ĲĴЈЉӇԈԒԔᒏĴЈЉ',
        'j':'ĳĵЛјӈԓԕȷɉʝ',
        'K':'ĶЌЖКҖҚҜҞҠӃԖԞԪКҖҚҜҞ',
        'k':'ķĸкҗқҝҟҡӄԗԟƙ',
        'L':'ĹĻĽĿŁḶḸḺḼᒺĿŁḶ',
        'l':'ĺļľŀłḷḹḻḽɫ',
        'M':'МӍᴍḾṀṂḾṀṂ',
        'm':'ӎᵚᵯmṃṁḿɱ',
        'N':'ŃŅŇŊЍИЙҊӢӤŃŅŇӢӤ',
        'n':'ńņňŉŋҋᵰŋńñņ',
        'O':'ŌŎŐŒОЮѺӦ⥀⥁ΌŎŐЮѺ',
        'o':'ōŏőœбоѻӧоȯøǫ',
        'P':'РҎԖⰒⰐᑬᑭᑮᑶᑸΡҎРᑬᑭ',
        'p':'рҏԗᵱⱀᖰρр',
        'Q':'ҀԚⰢ',
        'q':'ҁԛⱉ',
        'R':'ŔŖŘЯԄԆԖԘ℞ᖇŘЯԄ',
        'r':'ŕŗřѓгŕȓřɾ',
        'S':'ŚŜŞŠЅṦṨᔡŜŞЅṨ',
        's':'śŝşšѕᵴṩṧṥ',
        'T':'ŢŤŦЂЃЋГТѢѢҬԎТЃТҬ',
        't':'ţťŧҭԏ',
        'U':'ŨŪŬŮŰŲ⩂⩁⋃ᙈᙀŬŮŰ⩂',
        'u':'ũūŭůűųũ',
        'V':'ѴѶṼṾⰜ⩢⩣⩛⩝⍱⋁ᐻѶṼṾⰜ',
        'v':'ѵѷṿṽⱌ⩡ѵṽṿ',
        'W':'ŴѠѼѾԜŴѼѾ',
        'w':'ŵѡѽѿԝ',
        'X':'ЖХҖӁӜӼӾԔХҖӜӼ',
        'x':'жхҗӂӝӽӿԕẋ',
        'Y':'ŶŸЎУҮӮӰӲЎҮӮ',
        'y':'ŷуўӯӱӳӯ',
        'Z':'ŹŻŽᤏᤁŹŻŽ',
        'z':'źżžᙇ',
        '.':'.․⁝⁞',
        '?':'?‽⁇⁈',
        '!':'!‽⁉',
       }

DIA = (852,813,804,797,798,790,811,858,841,803,819,776,853,815,771,840,828,857,
       792,796,814,825,800,837,806,826,785,769,818,791,817,
       772,793,851,812,810,854,768,780,774,805,809,808,783,839,846,845,827,
       777,816,799,770)

def oddify(text):
    result = ""
    for i in text:
        try: result += choice(SLD[i])
        except:
            result += i
            # we can add as many diacritics as we like, but for now, just add one.
            result += chr(choice(DIA)) + chr(choice(DIA)) + chr(choice(DIA))
    return result

if __name__ == '__main__':
    s = input("enter the text you want to oddify: ")
    print(oddify(s))
    input("Press enter when done:")
